# Итоговая проверочная работа за 1 четверть
## Задача

Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше или равно 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.

## Описание решения

1.Метод ***ReleaseArray***.

* Вводим переменную **count**, равную нулю.
* В цикле **for** задаем переменую **i**, равную нулю. Указываем, что **i** меньше длины первоначального массива. Увеличиваем **i** на один при повторном прохождении цикла.
* Добавляем в цикле **for** условие **if**: "если длина строки из первоначального массива ***array1*** меньше или равна трем".
* При выполнении условия **if** элемент (**i**) из первоначального массива ***array1*** записывается в новый массив ***array2** (**count**). Переменная **count** увеличивается на 1 при повторном соблюдении условия **if**.

2.Метод ***PrintArray***.

* В цикле **for** задаем переменую **i**, равную нулю. Указываем, что **i** меньше длины массива. Увеличиваем **i** на один при повторном прохождении цикла.
* Выдаем каждый элемент массива с помощью ***Console.Write***.

3.Задаем первоначальный массив строк ***array1***.

4.Задаем новый массив строк ***array2***, длина которого равна длине первоначального массива ***array1***.

5.Программа:

* очистка консоли - ***Console.Clear***;
* написание текста: "Первоначальный массив: ";
* выдача массива по методу ***PrintArra***y;
* написание текста: "Новый массив, соответствующий условию: ";
* изменение массива по методу ***ReleaseArray***;
* выдача измененного массива с помощью иетода ***PrintArray***.
